package com.javaex.practice;

public class Ex05 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/*[Ex05.java] 
		자바소스파일(~. java)을 작성할 때 틀린것을 찾아 수정해보세요
		(1) 패키지명은 일반적으로 가독성을 위해 대문자(X), 소문자 섞어 사용한다. -> 관례로 도메인 거꾸로 한 이름으로 짓는다.
		(2) 클래스명은 소문자로만(X) 구성하여 작성한다 -> 클래스 앞글자 대문자
		(3) 자바소스파일(~.java)명과 클래스 이름은 대소문자까지 모두 동일한 단어를 사용해야된다. 
		-> 하나의 소스파일에 여러개의 클래스 정의 할 수 있음.
		-> public 으로 공개된 클래스는 반드시 소스파일명과 일치해야함.
		(4) 실행문 뒤(문자의 끝)에는 반드시 ( : )콜론(X)을 사용해야 한다. -> 세미콜론 ; 사용
		(5) 처음으로 실행되는 함수의 이름은 개발자가 임의로(X) 작성해서 만든다. -> psvm 고정
		
		*/

	}

}
